app/controllers/school_classes_controller.rb

INSERT INTO "school_classes" ("title", "room_number") VALUES (?, ?)  [["title", "hello"], ["room_number", 4]]
---
    def create
        @class = SchoolClass.create(permit_school_class(:title, :room_number))